const MSP_DATA = {
    lyceeName: 'Collège Annahda',
    profName: 'Lhossain Ait Taleb',
    imageLabel: '📸 Collège Annahda',
    remerciement: `أولاً وقبل كل شيء، نود أن نعرب عن خالص امتناننا للمدير {{people_abdelrahim-maadiri}} لإتاحته لنا الفرصة لخوض هذه التجربة التدريبية. كما نود أن نتقدم بأسمى آيات الشكر والامتنان لأستاذنا المشرف {{people_lhossain-ait-taleb}}، الذي تفضل بقبول توجيهنا ولم يتردد أبداً في تقديم دعمه الثمين ونصائحه وتشجيعه لنا طوال فترة تدريبنا.

كما نتقدم بالشكر لجميع المدربين في مركز CRMEF على جهودهم المتواصلة وتوجيهاتهم وتفانيهم طوال فترة تدريبنا.`,
    introduction: `يشكل التدريب الميداني مرحلة رئيسية في المنهج الأكاديمي. بالنسبة لنا كمدرسين متدربين، فهو يمثل فرصة مثالية لاختبار قدرتنا على الاندماج في فريق، وأخذ المبادرات، وتطوير استقلاليتنا بما يتجاوز مجرد إنجاز المهام المسندة إلينا. إنه ينطوي على مواجهة حقائق مختلفة داخل المدرسة المضيفة والتكيف معها كجزء طبيعي من تجربة التدريب.

في بداية التدريب الميداني، تظهر عدة تحديات بشكل طبيعي، بما في ذلك التعامل مع تعقيد المفاهيم المراد تدريسها، والتكيف مع بيئات الفصول الدراسية المختلفة، وإدارة انضباط الطلاب، على الرغم من أن بعض الفصول توفر تجربة أكثر سلاسة. تساهم هذه التجارب بشكل كبير في تطورنا المهني والشخصي كمدرسين مستقبليين.`,
    stageDates: '22 يناير – 21 مايو 2026',
    academie: 'جهة مراكش-آسفي',
    province: 'عمالة مراكش',
    milieu: 'حضري',
    tableData: {
        establishment: 'Annahda Middle School (ثانوية النهضة الاعدادية)',
        creationYear: '2003',
        roomsCount: '23 غرفة عادية، 1 غرفة علوم حاسوب',
        directorName: 'السيد عبد الرحيم الماصيري',
        mentorName: 'البروفسور لحسين آيت الطالب',
        studentsCount: '1349 (718 ذكور / 631 إناث)',
    },
    infrastructure: {
        teacherCount: '44 (21 رجال، 23 نساء)',
        adminCount: '8 (5 رجال، 3 نساء)',
        condition: 'جيد جداً',
        successRate: '70%',
        redoublementRate: '25%',
        abandonRate: '9%',
    },
    supervisorEvaluation: `تمت ملاحظة مجموعة من الملاحظات وتأطير تتبع وتأطير الأستاذ المتدرب معاد علاوي خلال فترة التداريب الميدانية بمادة المعلوميات. من الناحية الإيجابية، أظهر الأستاذ المتدرب جدية وانخراطًا فعالًا في العملية التعليمية التعلمية، مع قدرة جيدة على التنقل داخل الفصل وتنظيم فضاء التعلم، كما تواصل بشكل فعال مع المتعلمين وحفزهم على المشاركة. أظهر الأستاذ المتدرب تمكنًا من تنظيم السبورة وتوظيفها بشكل جيد، ولوحظ تحسن مستوى صوته مقارنة بالحصة الأولى. اتسمت الحصص بتناسق مراحل الدرس مع احترام التوجيهات التربوية المعتمدة. على المستوى المهني، تميز الأستاذ المتدرب بهندام لائق وسلوك مهني مسؤول. وبصفة عامة، أظهر الأستاذ المتدرب معاد علاوي تطورًا ملحوظًا خلال فترة التداريب الميدانية، واستفاد بشكل إيجابي من الملاحظات والتوجيهات المقدمة له.`,
}

export { MSP_DATA }
