const BLOGS = {
    list: {
        title: "📜 سجلات الكاتب",
        welcomeTitle: "مرحباً بك، أيها المسافر!",
        searchPlaceholder: "البحث عن اللفائف...",
        welcomeDesc: "هنا تكمن مجموعتي من المعرفة الغامضة، ومغامرات البرمجة، والمخطوطات التقنية. تحتوي هذه المخطوطات على الحكمة التي جمعتها طوال رحلتي في عوالم البرمجة الغامضة. عسى أن ترشدك في سعيك وراء المعرفة.",
        filterAll: "جميع المخطوطات",
        noResults: "لم يتم العثور على مخطوطات لهذا الرمز.",
        readTime: "قراءة {{time}} دقيقة",
        readCTA: "اقرأ المخطوطة",
        welcomeAlert: "مرحباً بك في كنوزي، أتمنى أن تجد كل ما ترغب فيه",
        devAlert: "هذه المدونات لا تزال تحت التطوير — شكراً لتفهمك",
        welcomeAlertConsolidated: "مرحباً بك في كنوزي، أيها المسافر! يرجى ملاحظة أن هذه المخطوطات لا تزال قيد الكتابة والتحديث.",
        savedScrolls: "المخطوطات المحفوظة",
        noSavedScrolls: "مخطوطتك فارغة. احفظ المخطوطات لقرائتها لاحقاً.",
    },
    post: {
        enteringAlert: "الدخول إلى غرفة الكتابات الغامضة",
        backToLibrary: "📚 العودة إلى المكتبة",
        backToHome: "🏰 المملكة",
        pennedOn: "📜 كُتبت في {{date}}",
        publishedOn: "نُشرت في {{date}}",
        prev: "المخطوطة السابقة",
        next: "المخطوطة التالية",
        notFound: "المخطوطة التي تبحث عنها تلاشت في الفراغ.",
        backToAllScrolls: "⬅️ العودة إلى جميع المخطوطات",
        bookmarkAdd: "✨ حفظ المخطوطة في كتاب التعاويذ",
        bookmarkRemove: "🔥 إزالة المخطوطة من كتاب التعاويذ",
        bookmarkAddedAlert: "تمت إضافة المخطوطة إلى كتاب تعاويذك!",
        bookmarkRemovedAlert: "تمت إزالة المخطوطة من كتاب تعاويذك!",
        qrTitle: "امسح المخطوطة",
    }
}

export {
    BLOGS,
}
